MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz2051ca9/thirdparty/pic32cz2051ca9/component/sqi.h
/* -------- SQI_BDTXDSTAT : (SQI Offset: 0x14C) (R/W 32) BD_TX_DMA_STATUS Register -------- */
#define SQI_BDTXDSTAT_TXCURBUFLEN_Pos         _UINT32_(0)                                          /* (SQI_BDTXDSTAT) This register field gives the length of the current buffer transmit length Position */
#define SQI_BDTXDSTAT_TXCURBUFLEN_Msk         (_UINT32_(0xFFFF) << SQI_BDTXDSTAT_TXCURBUFLEN_Pos)  /* (SQI_BDTXDSTAT) This register field gives the length of the current buffer transmit length Mask */
#define SQI_BDTXDSTAT_TXCURBUFLEN(value)      (SQI_BDTXDSTAT_TXCURBUFLEN_Msk & (_UINT32_(value) << SQI_BDTXDSTAT_TXCURBUFLEN_Pos)) /* Assignment of value for TXCURBUFLEN in the SQI_BDTXDSTAT register */
#define SQI_BDTXDSTAT_TXBUFCNT_Pos            _UINT32_(16)                                         /* (SQI_BDTXDSTAT) This register field gives the information about the internal transmit FIFO space. Position */
#define SQI_BDTXDSTAT_TXBUFCNT_Msk            (_UINT32_(0xFF) << SQI_BDTXDSTAT_TXBUFCNT_Pos)       /* (SQI_BDTXDSTAT) This register field gives the information about the internal transmit FIFO space. Mask */
#define SQI_BDTXDSTAT_TXBUFCNT(value)         (SQI_BDTXDSTAT_TXBUFCNT_Msk & (_UINT32_(value) << SQI_BDTXDSTAT_TXBUFCNT_Pos)) /* Assignment of value for TXBUFCNT in the SQI_BDTXDSTAT register */
#define SQI_BDTXDSTAT_Msk                     _UINT32_(0x00FFFFFF)                                 /* (SQI_BDTXDSTAT) Register Mask  */


/* -------- SQI_BDRXDSTAT : (SQI Offset: 0x150) ( R/ 32) BD_RX_DMA_STATUS Register -------- */
#define SQI_BDRXDSTAT_RXCURBUFLEN_Pos         _UINT32_(0)                                          /* (SQI_BDRXDSTAT) This register field gives the length of the current buffer receive length Position */
#define SQI_BDRXDSTAT_RXCURBUFLEN_Msk         (_UINT32_(0xFFFF) << SQI_BDRXDSTAT_RXCURBUFLEN_Pos)  /* (SQI_BDRXDSTAT) This register field gives the length of the current buffer receive length Mask */
#define SQI_BDRXDSTAT_RXCURBUFLEN(value)      (SQI_BDRXDSTAT_RXCURBUFLEN_Msk & (_UINT32_(value) << SQI_BDRXDSTAT_RXCURBUFLEN_Pos)) /* Assignment of value for RXCURBUFLEN in the SQI_BDRXDSTAT register */
#define SQI_BDRXDSTAT_RXBUFCNT_Pos            _UINT32_(16)                                         /* (SQI_BDRXDSTAT) This register field gives the information about the internal receive FIFO space. Position */
#define SQI_BDRXDSTAT_RXBUFCNT_Msk            (_UINT32_(0x1) << SQI_BDRXDSTAT_RXBUFCNT_Pos)        /* (SQI_BDRXDSTAT) This register field gives the information about the internal receive FIFO space. Mask */
#define SQI_BDRXDSTAT_RXBUFCNT(value)         (SQI_BDRXDSTAT_RXBUFCNT_Msk & (_UINT32_(value) << SQI_BDRXDSTAT_RXBUFCNT_Pos)) /* Assignment of value for RXBUFCNT in the SQI_BDRXDSTAT register */
#define SQI_BDRXDSTAT_Msk                     _UINT32_(0x0001FFFF)                                 /* (SQI_BDRXDSTAT) Register Mask  */


/* -------- SQI_THR : (SQI Offset: 0x154) (R/W 32) SPI Control threshold register -------- */
#define SQI_THR_RESETVALUE                    _UINT32_(0x00)                                       /*  (SQI_THR) SPI Control threshold register  Reset Value */

#define SQI_THR_THRES_Pos                     _UINT32_(0)                                          /* (SQI_THR) SPI Control Threshold Value. SPI Control Threshold Interrupt is asserted, whenever larger than SPI Control Threshold amount of space available in SPI Control Buffer. Position */
#define SQI_THR_THRES_Msk                     (_UINT32_(0x7) << SQI_THR_THRES_Pos)                 /* (SQI_THR) SPI Control Threshold Value. SPI Control Threshold Interrupt is asserted, whenever larger than SPI Control Threshold amount of space available in SPI Control Buffer. Mask */
#define SQI_THR_THRES(value)                  (SQI_THR_THRES_Msk & (_UINT32_(value) << SQI_THR_THRES_Pos)) /* Assignment of value for THRES in the SQI_THR register */
#define SQI_THR_Msk                           _UINT32_(0x00000007)                                 /* (SQI_THR) Register Mask  */


/* -------- SQI_INTSIGEN : (SQI Offset: 0x158) (R/W 32) SPI Interrupt Signal Enable Register -------- */
#define SQI_INTSIGEN_RESETVALUE               _UINT32_(0x8AD)                                      /*  (SQI_INTSIGEN) SPI Interrupt Signal Enable Register  Reset Value */

#define SQI_INTSIGEN_TXEMPTYISE_Pos           _UINT32_(0)                                          /* (SQI_INTSIGEN) TX FIFO Empty Interrupt Signal Enable. Position */
#define SQI_INTSIGEN_TXEMPTYISE_Msk           (_UINT32_(0x1) << SQI_INTSIGEN_TXEMPTYISE_Pos)       /* (SQI_INTSIGEN) TX FIFO Empty Interrupt Signal Enable. Mask */
#define SQI_INTSIGEN_TXEMPTYISE(value)        (SQI_INTSIGEN_TXEMPTYISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_TXEMPTYISE_Pos)) /* Assignment of value for TXEMPTYISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_TXFULLISE_Pos            _UINT32_(1)                                          /* (SQI_INTSIGEN) TX FIFO Full Interrupt Signal Enable. Position */
#define SQI_INTSIGEN_TXFULLISE_Msk            (_UINT32_(0x1) << SQI_INTSIGEN_TXFULLISE_Pos)        /* (SQI_INTSIGEN) TX FIFO Full Interrupt Signal Enable. Mask */
#define SQI_INTSIGEN_TXFULLISE(value)         (SQI_INTSIGEN_TXFULLISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_TXFULLISE_Pos)) /* Assignment of value for TXFULLISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_TXTHRISE_Pos             _UINT32_(2)                                          /* (SQI_INTSIGEN) Signal Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words. Position */
#define SQI_INTSIGEN_TXTHRISE_Msk             (_UINT32_(0x1) << SQI_INTSIGEN_TXTHRISE_Pos)         /* (SQI_INTSIGEN) Signal Enable Interrupt to be generated when the TX FIFO has space equal to or more than TX_INT_THRES words. Mask */
#define SQI_INTSIGEN_TXTHRISE(value)          (SQI_INTSIGEN_TXTHRISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_TXTHRISE_Pos)) /* Assignment of value for TXTHRISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_RXEMPTYISE_Pos           _UINT32_(3)                                          /* (SQI_INTSIGEN) RX FIFO Empty Interrupt Signal Enable. Position */
#define SQI_INTSIGEN_RXEMPTYISE_Msk           (_UINT32_(0x1) << SQI_INTSIGEN_RXEMPTYISE_Pos)       /* (SQI_INTSIGEN) RX FIFO Empty Interrupt Signal Enable. Mask */
#define SQI_INTSIGEN_RXEMPTYISE(value)        (SQI_INTSIGEN_RXEMPTYISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_RXEMPTYISE_Pos)) /* Assignment of value for RXEMPTYISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_RXFULLISE_Pos            _UINT32_(4)                                          /* (SQI_INTSIGEN) RX FIFO Full Interrupt Signal Enable. Position */
#define SQI_INTSIGEN_RXFULLISE_Msk            (_UINT32_(0x1) << SQI_INTSIGEN_RXFULLISE_Pos)        /* (SQI_INTSIGEN) RX FIFO Full Interrupt Signal Enable. Mask */
#define SQI_INTSIGEN_RXFULLISE(value)         (SQI_INTSIGEN_RXFULLISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_RXFULLISE_Pos)) /* Assignment of value for RXFULLISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_RXTHRISE_Pos             _UINT32_(5)                                          /* (SQI_INTSIGEN) Signal Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words.  In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus. Position */
#define SQI_INTSIGEN_RXTHRISE_Msk             (_UINT32_(0x1) << SQI_INTSIGEN_RXTHRISE_Pos)         /* (SQI_INTSIGEN) Signal Enable Interrupt to be generated when the RX FIFO has data more than or equal to RX_INT_THRES words.  In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus. Mask */
#define SQI_INTSIGEN_RXTHRISE(value)          (SQI_INTSIGEN_RXTHRISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_RXTHRISE_Pos)) /* Assignment of value for RXTHRISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_CONFULLISE_Pos           _UINT32_(6)                                          /* (SQI_INTSIGEN) Control Buffer Full Interrupt Signal Enable Position */
#define SQI_INTSIGEN_CONFULLISE_Msk           (_UINT32_(0x1) << SQI_INTSIGEN_CONFULLISE_Pos)       /* (SQI_INTSIGEN) Control Buffer Full Interrupt Signal Enable Mask */
#define SQI_INTSIGEN_CONFULLISE(value)        (SQI_INTSIGEN_CONFULLISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_CONFULLISE_Pos)) /* Assignment of value for CONFULLISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_CONEMPTYISE_Pos          _UINT32_(7)                                          /* (SQI_INTSIGEN) Control Buffer Empty Interrupt Signal Enable Position */
#define SQI_INTSIGEN_CONEMPTYISE_Msk          (_UINT32_(0x1) << SQI_INTSIGEN_CONEMPTYISE_Pos)      /* (SQI_INTSIGEN) Control Buffer Empty Interrupt Signal Enable Mask */
#define SQI_INTSIGEN_CONEMPTYISE(value)       (SQI_INTSIGEN_CONEMPTYISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_CONEMPTYISE_Pos)) /* Assignment of value for CONEMPTYISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_CONTHRISE_Pos            _UINT32_(8)                                          /* (SQI_INTSIGEN) Control Buffer Threshold Interrupt Signal Enable Position */
#define SQI_INTSIGEN_CONTHRISE_Msk            (_UINT32_(0x1) << SQI_INTSIGEN_CONTHRISE_Pos)        /* (SQI_INTSIGEN) Control Buffer Threshold Interrupt Signal Enable Mask */
#define SQI_INTSIGEN_CONTHRISE(value)         (SQI_INTSIGEN_CONTHRISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_CONTHRISE_Pos)) /* Assignment of value for CONTHRISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_BDDONEISE_Pos            _UINT32_(9)                                          /* (SQI_INTSIGEN) Current Buffer Descriptor Interrupt Signal Enable Position */
#define SQI_INTSIGEN_BDDONEISE_Msk            (_UINT32_(0x1) << SQI_INTSIGEN_BDDONEISE_Pos)        /* (SQI_INTSIGEN) Current Buffer Descriptor Interrupt Signal Enable Mask */
#define SQI_INTSIGEN_BDDONEISE(value)         (SQI_INTSIGEN_BDDONEISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_BDDONEISE_Pos)) /* Assignment of value for BDDONEISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_PKTCOMPISE_Pos           _UINT32_(10)                                         /* (SQI_INTSIGEN) Packet completion Interrupt Signal Enable Position */
#define SQI_INTSIGEN_PKTCOMPISE_Msk           (_UINT32_(0x1) << SQI_INTSIGEN_PKTCOMPISE_Pos)       /* (SQI_INTSIGEN) Packet completion Interrupt Signal Enable Mask */
#define SQI_INTSIGEN_PKTCOMPISE(value)        (SQI_INTSIGEN_PKTCOMPISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_PKTCOMPISE_Pos)) /* Assignment of value for PKTCOMPISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_DMAEISE_Pos              _UINT32_(11)                                         /* (SQI_INTSIGEN) Master Error Interrupt Signal Enable Position */
#define SQI_INTSIGEN_DMAEISE_Msk              (_UINT32_(0x1) << SQI_INTSIGEN_DMAEISE_Pos)          /* (SQI_INTSIGEN) Master Error Interrupt Signal Enable Mask */
#define SQI_INTSIGEN_DMAEISE(value)           (SQI_INTSIGEN_DMAEISE_Msk & (_UINT32_(value) << SQI_INTSIGEN_DMAEISE_Pos)) /* Assignment of value for DMAEISE in the SQI_INTSIGEN register */
#define SQI_INTSIGEN_Msk                      _UINT32_(0x00000FFF)                                 /* (SQI_INTSIGEN) Register Mask  */


/* -------- SQI_TAPCON : (SQI Offset: 0x15C) (R/W 32) Tap Control Register -------- */
#define SQI_TAPCON_RESETVALUE                 _UINT32_(0x110021)                                   /*  (SQI_TAPCON) Tap Control Register  Reset Value */

