MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz2051ca9/thirdparty/pic32cz2051ca9/component/sqi.h
/* SQI register offsets definitions */
#define SQI_BDCTRL_REG_OFST            _UINT32_(0x00)      /* (SQI_BDCTRL) Buffer Descriptor Control Register Offset */
#define SQI_BDSTATUS_REG_OFST          _UINT32_(0x04)      /* (SQI_BDSTATUS) Buffer Descriptor Status Register Offset */
#define SQI_BDADDR_REG_OFST            _UINT32_(0x08)      /* (SQI_BDADDR) Buffer Descriptor Address Register Offset */
#define SQI_BDNXTPTR_REG_OFST          _UINT32_(0x0C)      /* (SQI_BDNXTPTR) Buffer Descriptor Next Pointer Register Offset */
#define SQI_CTRLA_REG_OFST             _UINT32_(0x00)      /* (SQI_CTRLA) Control A register Offset */
#define SQI_INTENCLR_REG_OFST          _UINT32_(0x10)      /* (SQI_INTENCLR) Interrupt Enable Clear Register Offset */
#define SQI_INTENSET_REG_OFST          _UINT32_(0x14)      /* (SQI_INTENSET) Interrupt Enable Set Register Offset */
#define SQI_INTFLAG_REG_OFST           _UINT32_(0x18)      /* (SQI_INTFLAG) Interrupt Status and Clear Register Offset */
#define SQI_SYNCBUSY_REG_OFST          _UINT32_(0x20)      /* (SQI_SYNCBUSY) Syncbusy Register Offset */
#define SQI_XCON1_REG_OFST             _UINT32_(0x100)     /* (SQI_XCON1) SPI XIP Control1 register Offset */
#define SQI_XCON2_REG_OFST             _UINT32_(0x104)     /* (SQI_XCON2) SPI XIP Control2 register Offset */
#define SQI_CFG_REG_OFST               _UINT32_(0x108)     /* (SQI_CFG) SPI Configuration Register Offset */
#define SQI_CON_REG_OFST               _UINT32_(0x10C)     /* (SQI_CON) SPI Control register Offset */
#define SQI_CLKCON_REG_OFST            _UINT32_(0x110)     /* (SQI_CLKCON) SPI Clock Control register Offset */
#define SQI_CMDTHR_REG_OFST            _UINT32_(0x114)     /* (SQI_CMDTHR) SPI command threshold register Offset */
#define SQI_INTTHR_REG_OFST            _UINT32_(0x118)     /* (SQI_INTTHR) SPI Interrupt Threshold register Offset */
#define SQI_INTEN_REG_OFST             _UINT32_(0x11C)     /* (SQI_INTEN) SPI Interrupt Enable Register Offset */
#define SQI_INTSTAT_REG_OFST           _UINT32_(0x120)     /* (SQI_INTSTAT) SPI Interrupt Status Register Offset */
#define SQI_TXDATA_REG_OFST            _UINT32_(0x124)     /* (SQI_TXDATA) SPI Transmit Data Register Offset */
#define SQI_RXDATA_REG_OFST            _UINT32_(0x128)     /* (SQI_RXDATA) SPI Receive Data Register Offset */
#define SQI_STAT1_REG_OFST             _UINT32_(0x12C)     /* (SQI_STAT1) SPI Status1 Register Offset */
#define SQI_STAT2_REG_OFST             _UINT32_(0x130)     /* (SQI_STAT2) SPI status 2 register Offset */
#define SQI_BDCON_REG_OFST             _UINT32_(0x134)     /* (SQI_BDCON) BD_CTRL Register Offset */
#define SQI_BDCURADD_REG_OFST          _UINT32_(0x138)     /* (SQI_BDCURADD) BD_CURR_ADDR Register Offset */
#define SQI_BDBASEADD_REG_OFST         _UINT32_(0x140)     /* (SQI_BDBASEADD) BD_BASE_ADDR register Offset */
#define SQI_BDSTAT_REG_OFST            _UINT32_(0x144)     /* (SQI_BDSTAT) BD_STATUS Register Offset */
#define SQI_BDPOLLCON_REG_OFST         _UINT32_(0x148)     /* (SQI_BDPOLLCON) BD_POLL_CTRL Register Offset */
#define SQI_BDTXDSTAT_REG_OFST         _UINT32_(0x14C)     /* (SQI_BDTXDSTAT) BD_TX_DMA_STATUS Register Offset */
#define SQI_BDRXDSTAT_REG_OFST         _UINT32_(0x150)     /* (SQI_BDRXDSTAT) BD_RX_DMA_STATUS Register Offset */
#define SQI_THR_REG_OFST               _UINT32_(0x154)     /* (SQI_THR) SPI Control threshold register Offset */
#define SQI_INTSIGEN_REG_OFST          _UINT32_(0x158)     /* (SQI_INTSIGEN) SPI Interrupt Signal Enable Register Offset */
#define SQI_TAPCON_REG_OFST            _UINT32_(0x15C)     /* (SQI_TAPCON) Tap Control Register Offset */
#define SQI_MEMSTAT_REG_OFST           _UINT32_(0x160)     /* (SQI_MEMSTAT) SPI Status Control Register Offset */
#define SQI_XCON3_REG_OFST             _UINT32_(0x164)     /* (SQI_XCON3) SPI XIP Control 3 Register Offset */
#define SQI_XCON4_REG_OFST             _UINT32_(0x168)     /* (SQI_XCON4) SPI XIP Control4 Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SQI_DESCRIPTOR register API structure */
typedef struct
{  /* Polaris Serial Quad Interface SIB */
  __IO  uint32_t                       SQI_BDCTRL;         /* Offset: 0x00 (R/W  32) Buffer Descriptor Control Register */
  __IO  uint32_t                       SQI_BDSTATUS;       /* Offset: 0x04 (R/W  32) Buffer Descriptor Status Register */
  __IO  uint32_t                       SQI_BDADDR;         /* Offset: 0x08 (R/W  32) Buffer Descriptor Address Register */
  __IO  uint32_t                       SQI_BDNXTPTR;       /* Offset: 0x0C (R/W  32) Buffer Descriptor Next Pointer Register */
} sqi_descriptor_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/* SQI register API structure */
typedef struct
{  /* Polaris Serial Quad Interface SIB */
  __IO  uint32_t                       SQI_CTRLA;          /* Offset: 0x00 (R/W  32) Control A register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       SQI_INTENCLR;       /* Offset: 0x10 (R/W  32) Interrupt Enable Clear Register */
  __IO  uint32_t                       SQI_INTENSET;       /* Offset: 0x14 (R/W  32) Interrupt Enable Set Register */
  __IO  uint32_t                       SQI_INTFLAG;        /* Offset: 0x18 (R/W  32) Interrupt Status and Clear Register */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       SQI_SYNCBUSY;       /* Offset: 0x20 (R/   32) Syncbusy Register */
  __I   uint8_t                        Reserved3[0xDC];
  __IO  uint32_t                       SQI_XCON1;          /* Offset: 0x100 (R/W  32) SPI XIP Control1 register */
  __IO  uint32_t                       SQI_XCON2;          /* Offset: 0x104 (R/W  32) SPI XIP Control2 register */
  __IO  uint32_t                       SQI_CFG;            /* Offset: 0x108 (R/W  32) SPI Configuration Register */
  __IO  uint32_t                       SQI_CON;            /* Offset: 0x10C (R/W  32) SPI Control register */
  __IO  uint32_t                       SQI_CLKCON;         /* Offset: 0x110 (R/W  32) SPI Clock Control register */
  __IO  uint32_t                       SQI_CMDTHR;         /* Offset: 0x114 (R/W  32) SPI command threshold register */
  __IO  uint32_t                       SQI_INTTHR;         /* Offset: 0x118 (R/W  32) SPI Interrupt Threshold register */
  __IO  uint32_t                       SQI_INTEN;          /* Offset: 0x11C (R/W  32) SPI Interrupt Enable Register */
  __IO  uint32_t                       SQI_INTSTAT;        /* Offset: 0x120 (R/W  32) SPI Interrupt Status Register */
  __IO  uint32_t                       SQI_TXDATA;         /* Offset: 0x124 (R/W  32) SPI Transmit Data Register */
  __I   uint32_t                       SQI_RXDATA;         /* Offset: 0x128 (R/   32) SPI Receive Data Register */
  __I   uint32_t                       SQI_STAT1;          /* Offset: 0x12C (R/   32) SPI Status1 Register */
  __I   uint32_t                       SQI_STAT2;          /* Offset: 0x130 (R/   32) SPI status 2 register */
  __IO  uint32_t                       SQI_BDCON;          /* Offset: 0x134 (R/W  32) BD_CTRL Register */
  __I   uint32_t                       SQI_BDCURADD;       /* Offset: 0x138 (R/   32) BD_CURR_ADDR Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       SQI_BDBASEADD;      /* Offset: 0x140 (R/W  32) BD_BASE_ADDR register */
  __I   uint32_t                       SQI_BDSTAT;         /* Offset: 0x144 (R/   32) BD_STATUS Register */
  __IO  uint32_t                       SQI_BDPOLLCON;      /* Offset: 0x148 (R/W  32) BD_POLL_CTRL Register */
  __IO  uint32_t                       SQI_BDTXDSTAT;      /* Offset: 0x14C (R/W  32) BD_TX_DMA_STATUS Register */
  __I   uint32_t                       SQI_BDRXDSTAT;      /* Offset: 0x150 (R/   32) BD_RX_DMA_STATUS Register */
  __IO  uint32_t                       SQI_THR;            /* Offset: 0x154 (R/W  32) SPI Control threshold register */
  __IO  uint32_t                       SQI_INTSIGEN;       /* Offset: 0x158 (R/W  32) SPI Interrupt Signal Enable Register */
  __IO  uint32_t                       SQI_TAPCON;         /* Offset: 0x15C (R/W  32) Tap Control Register */
  __IO  uint32_t                       SQI_MEMSTAT;        /* Offset: 0x160 (R/W  32) SPI Status Control Register */
  __IO  uint32_t                       SQI_XCON3;          /* Offset: 0x164 (R/W  32) SPI XIP Control 3 Register */
  __IO  uint32_t                       SQI_XCON4;          /* Offset: 0x168 (R/W  32) SPI XIP Control4 Register */
} sqi_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/* SQI_DESCRIPTOR memory section attribute */
#if defined (__GNUC__) || defined (__CC_ARM)
 #define SECTION_SQI_DESCRIPTOR       __attribute__ ((section(".flexram")))
#elif defined (__ICCARM__)
 #define SECTION_SQI_DESCRIPTOR       @".flexram"
#else
 #ifndef SECTION_SQI_DESCRIPTOR
  #error SECTION_SQI_DESCRIPTOR must be defined for compiler to use memory section .flexram
 #endif
#endif

#endif /* _PIC32CZCA91_SQI_COMPONENT_H_ */
